"common.ok" = "ОК";
"common.cancel" = "Отмена";
"common.save" = "Сохранить";
"common.done" = "Готово";
"common.na" = "н/д";
"app.language" = "app.language";

"language.section" = "Язык";
"language.system" = "Системный";
"language.english" = "Английский";
"language.russian" = "Русский";

"panel.title" = "Симулятор цифрового двойника БПЛА";
"panel.keyboard_hint" = "WASD/QE полет, Shift ускорение, 1..6 камеры, M карта, / компас, стрелки только FPV, +/- зум";
"panel.workflow_hint" = "Основные команды находятся в верхней ленте. Показывайте и скрывайте параметры кнопками панели.";
"panel.toggle_collapse" = "Свернуть/развернуть панель";
"panel.collapse" = "Свернуть панель";
"panel.expand" = "Развернуть панель";
"panel.parameters.on" = "Параметры: Вкл";
"panel.parameters.off" = "Параметры: Выкл";
"panel.hide" = "Скрыть панель параметров";
"panel.show" = "Показать панель параметров";
"panel.drone_profile" = "Профиль БПЛА";
"panel.model" = "Модель";
"panel.mass" = "Масса";
"panel.max_flight" = "Макс. время полета";
"panel.max_wind" = "Сопротивление ветру";
"panel.camera_layout" = "Компоновка камер";
"panel.visual_class" = "Визуальный класс";
"panel.commands" = "Команды";
"panel.position" = "Положение";
"panel.orientation" = "Ориентация";
"panel.throttle" = "Тяга";
"panel.camera" = "Камера";
"panel.camera_mode" = "Режим камеры";
"panel.weather" = "Погода";
"panel.terrain" = "Местность";
"panel.diagnostics" = "Диагностика";
"panel.fleet" = "Группа";
"panel.damage" = "Повреждения и состояние";
"panel.warnings" = "Предупреждения";
"panel.telemetry" = "Телеметрия";

"axis.x" = "X";
"axis.y" = "Y";
"axis.z" = "Z";
"axis.roll" = "Крен";
"axis.pitch" = "Тангаж";
"axis.yaw" = "Рыскание";

"camera.mode.free" = "Свободная";
"camera.mode.follow" = "Вид от хвоста";
"camera.mode.third_person" = "Вид сзади";
"camera.mode.fpv" = "FPV";
"camera.mode.orbit" = "Орбита";
"camera.mode.top" = "Вид сверху";
"camera.mode.payload" = "Сброс ПН";
"camera.mode.top_down" = "Вид сверху";
"camera.payload.auto_switch" = "Автопереход на камеру ПН после сброса";
"camera.fov" = "Угол обзора";
"camera.sensitivity" = "Чувствительность";
"camera.smoothing" = "Сглаживание";
"camera.orbit_distance" = "Дистанция орбиты";
"camera.follow_x" = "Смещение следования X";
"camera.follow_y" = "Смещение следования Y";
"camera.follow_z" = "Смещение следования Z";
"camera.fpv_stabilization" = "FPV стабилизация";
"camera.fpv_shake" = "FPV дрожание";

"command.reset" = "Сброс";
"command.takeoff" = "Взлет";
"command.land" = "Посадка";
"command.hover" = "Зависнуть";
"command.auto_path" = "Авто-маршрут";
"command.return_home" = "Возврат домой";
"command.emergency_stop" = "Аварийная остановка";
"command.start_animation" = "Запустить симуляцию";
"command.stop_animation" = "Остановить симуляцию";

"weather.normal" = "Обычная";
"weather.wind" = "Ветер";
"weather.rain" = "Дождь";
"weather.snow" = "Снег";
"weather.fog" = "Туман";
"weather.smog" = "Смог";
"weather.thunderstorm" = "Гроза";
"weather.intensity" = "Интенсивность";
"weather.wind_direction" = "Направление ветра";
"weather.wind_speed" = "Скорость ветра";
"weather.gusts" = "Порывы";

"terrain.grid_demo" = "Сетка (демо)";
"terrain.field" = "Поле";
"terrain.forest" = "Лес";
"terrain.cargo_yard" = "Грузовой двор";
"terrain.city" = "Город";
"terrain.density" = "Плотность объектов";
"terrain.seed" = "Сид генератора";
"terrain.scale" = "Масштаб карты";
"terrain.scale.4x4" = "4x4";
"terrain.scale.8x8" = "8x8";
"terrain.scale.16x16" = "16x16";
"terrain.scale.32x32" = "32x32";
"terrain.scale.64x64" = "64x64";
"terrain.scale.128x128" = "128x128";
"terrain.scale.256x256" = "256x256";
"environment.boundary_barrier_visible" = "Показывать граничный барьер";

"diagnostic.mode" = "Режим диагностики";
"diagnostic.mode.normal" = "Обычный вид";
"diagnostic.mode.thermal" = "Тепло / Нагрузка";
"diagnostic.mode.damage" = "Повреждения / Целостность";
"diagnostic.collision_debug" = "Отладка коллизий";
"diagnostic.toggle_thermal" = "Тепловой слой";
"diagnostic.toggle_damage" = "Слой повреждений";
"diagnostic.fleet_mode" = "Включить группу";

"fleet.formation" = "Построение";
"fleet.mode.off" = "Выкл";
"fleet.mode.line" = "Линия";
"fleet.mode.triangle" = "Треугольник";
"fleet.separation" = "Интервал";
"fleet.wingmen" = "Ведомые";
"fleet.risk" = "Риск между дронами";
"fleet.nearest" = "Минимальная дистанция";

"damage.reset" = "Сбросить повреждения";
"damage.clear_selection" = "Снять выбор";
"damage.hide" = "Скрыть";

"component.battery" = "Батарея";
"component.gimbal" = "Передняя камера / подвес";
"component.fc_core" = "Ядро полетного контроллера";
"component.motor_fl" = "Мотор FL";
"component.motor_fr" = "Мотор FR";
"component.motor_rl" = "Мотор RL";
"component.motor_rr" = "Мотор RR";
"component.propeller_fl" = "Пропеллер FL";
"component.propeller_fr" = "Пропеллер FR";
"component.propeller_rl" = "Пропеллер RL";
"component.propeller_rr" = "Пропеллер RR";
"component.arm_fl" = "Луч FL";
"component.arm_fr" = "Луч FR";
"component.arm_rl" = "Луч RL";
"component.arm_rr" = "Луч RR";
"component.esc_power" = "ESC / силовая электроника";

"warning.nominal" = "Норма";
"warning.warning" = "Внимание";
"warning.critical" = "Критично";
"warning.collision_high" = "Высокий риск столкновения";
"warning.weather_severe" = "Сложные погодные условия";
"warning.battery_low" = "Низкий заряд батареи";
"warning.integrity_low" = "Низкая структурная целостность";
"warning.fixedwing_low_speed" = "Низкая скорость самолётного БПЛА / риск сваливания";
"warning.fleet_risk" = "Риск в построении группы";
"warning.interdrone_critical" = "Критическое сближение дронов";
"warning.emergency" = "Активирован аварийный режим";
"warnings.none" = "Активных предупреждений нет";
"summary.damage.none" = "Критичных повреждений нет";

"signal_loss.warning" = "Сигнал будет утерян через %d...";
"signal_loss.lost_title" = "Сигнал потерян";
"signal_loss.lost_message" = "Аппарат вышел за пределы карты. Управление заблокировано до восстановления сигнала.";
"signal_loss.recover" = "Восстановить сигнал";

"telemetry.position" = "Координаты";
"telemetry.velocity" = "Скорость (вектор)";
"telemetry.attitude" = "Ориентация";
"telemetry.speed" = "Скорость";
"telemetry.throttle" = "Тяга";
"telemetry.mode" = "Режим";
"telemetry.state" = "Состояние";
"telemetry.battery" = "Батарея";
"telemetry.power" = "Потребление";
"telemetry.remaining" = "Осталось";
"telemetry.weather" = "Погода";
"telemetry.collision_risk" = "Риск столкновения";
"telemetry.nearest_obstacle" = "Ближайшее препятствие";
"telemetry.emergency" = "Аварийное действие";
"telemetry.mission_status" = "Статус миссии";
"telemetry.damage" = "Повреждения";
"telemetry.thermal" = "Тепловая сводка";
"telemetry.fleet" = "Режим группы";
"telemetry.fleet_risk" = "Риск группы";
"telemetry.nearest_interdrone" = "До ближайшего дрона";
"telemetry.export" = "Экспорт телеметрии";
"telemetry.export.success" = "Телеметрия экспортирована";
"telemetry.export.failure" = "Ошибка экспорта телеметрии";

"mission.map.open_help" = "Карта миссии";
"mission.map.title" = "КАРТА МИССИИ";
"mission.map.subtitle" = "Экран планирования маршрута и зоны доставки полезной нагрузки";
"mission.map.exit" = "ВЫЙТИ ИЗ КАРТЫ";
"mission.map.clear_route" = "ОЧИСТИТЬ МАРШРУТ";
"mission.map.clear_drop_zone" = "ОЧИСТИТЬ ЗОНУ СБРОСА";
"mission.map.cancel" = "ОТМЕНИТЬ";
"mission.map.confirm" = "ПОДТВЕРДИТЬ МИССИЮ";
"mission.map.instruction.route" = "Кликните по карте, чтобы задать целевую точку маршрута";
"mission.map.instruction.drop_zone_center" = "Кликните по карте, чтобы задать центр зоны сброса";
"mission.map.instruction.drop_zone_radius" = "Настройте радиус зоны и подтвердите миссию";
"mission.map.summary.format" = "БЛА %+.1f / %+.1f   БАЗА %+.1f / %+.1f   КАРТА %.0f м";
"mission.map.section.route" = "МАРШРУТ";
"mission.map.section.drop_zone" = "ЗОНА СБРОСА";
"mission.map.section.zone_radius" = "РАДИУС ЗОНЫ";
"mission.map.section.payload_delivery" = "ДОСТАВКА ПОЛЕЗНОЙ НАГРУЗКИ";
"mission.map.zone_radius.value" = "%.1f м";
"mission.map.auto_release" = "Автосброс над центром зоны";
"mission.map.payload_ready" = "Подвешенная полезная нагрузка готова к доставке";
"mission.map.payload_unavailable" = "Для этапа доставки нет прикрепленной полезной нагрузки";
"mission.map.active_drop_zone" = "ЗОНА ЕСТЬ";
"mission.map.no_drop_zone" = "ЗОНЫ НЕТ";
"mission.map.active_route" = "МАРШРУТ ЕСТЬ";
"mission.map.no_route" = "МАРШРУТА НЕТ";
"mission.map.footer_hint" = "Карта миссии не управляет БЛА напрямую. Подтвержденные цели передаются в существующий контур наведения.";
"mission.map.no_route_target" = "Маршрут не задан";
"mission.map.no_drop_zone_value" = "Зона сброса не задана";
"mission.map.route.value.format" = "X %+.1f   Z %+.1f";
"mission.map.drop_zone.value.format" = "ЦЕНТР %+.1f / %+.1f   R %.1f м";
"mission.mode.navigation" = "МАРШРУТ";
"mission.mode.drop_zone" = "ЗОНА СБРОСА";
"mission.status.map_active" = "КАРТА МИССИИ АКТИВНА";
"mission.status.drop_zone_set" = "ЗОНА СБРОСА ЗАДАНА";
"mission.status.delivery_ready" = "МИССИЯ ДОСТАВКИ ГОТОВА";
"mission.status.in_drop_zone" = "БЛА В ЗОНЕ СБРОСА";
"mission.status.payload_released" = "ПОЛЕЗНАЯ НАГРУЗКА СБРОШЕНА";

"hud.title" = "HUD телеметрии";
"hud.telemetry" = "Телеметрия";
"hud.camera" = "Камера";
"hud.drone" = "Дрон";

"mode.manual" = "Ручной";
"mode.auto_path" = "Авто-маршрут";
"mode.return_home" = "Возврат домой";
"mode.hover" = "Зависание";
"mode.emergency_stop" = "Аварийная остановка";
"mode.takeoff" = "Взлет";
"mode.landing" = "Посадка";

"flight_state.on_ground" = "На земле";
"flight_state.battery_depleted" = "Батарея разряжена";
"flight_state.ascending" = "Набор высоты";
"flight_state.descending" = "Снижение";
"flight_state.emergency" = "Авария";
"flight_state.stable" = "Стабильно";
"flight_state.climbing" = "Подъем";
"flight_state.cruise" = "Крейсерский";

"emergency.none" = "Нет";
"emergency.slow_down" = "Снизить скорость";
"emergency.hover" = "Зависнуть";
"emergency.avoid" = "Обход";
"emergency.stop" = "Аварийная остановка";

"battery.depleted.title" = "Батарея разряжена";
"battery.depleted.message" = "Заряд полностью исчерпан. Выберите действие для продолжения.";
"battery.depleted.charge" = "Зарядить дрон";
"battery.depleted.restart" = "Перезапустить сценарий";

"abstract.edit" = "Редактировать параметры";
"abstract.editor.title" = "Параметры абстрактного БЛА";
"abstract.editor.mass" = "Масса";
"abstract.editor.dimensions" = "Габариты";
"abstract.editor.energy" = "Энергия и ограничения";
"abstract.editor.control" = "Управляемость";
"abstract.validation.vertical" = "Скорость набора/снижения слишком мала.";
"abstract.validation.speed" = "Горизонтальная скорость должна быть >= вертикальных.";
"abstract.validation.radius" = "Радиус коллизии слишком велик для выбранных габаритов.";

"drone.model.lipo_scout4" = "LIPO Scout 4";
"drone.model.lipo_vector3s" = "LIPO Vector 3S";
"drone.model.lipo_atlas3pro" = "LIPO Atlas 3 Pro";
"drone.model.abstract" = "Абстрактный БЛА";

"drone.visual.mini" = "Легкий компактный квадрокоптер";
"drone.visual.vector" = "Средний квадрокоптер с двумя камерами";
"drone.visual.atlas" = "Крупный профессиональный квадрокоптер";
"drone.visual.abstract" = "Пользовательский абстрактный профиль";

"drone.camera.single_compact" = "Один компактный фронтальный подвес";
"drone.camera.dual_front" = "Двойной фронтальный камерный модуль";
"drone.camera.triple_front" = "Тройной фронтальный камерный модуль";
"drone.camera.custom" = "Пользовательский редактируемый модуль";

"ui.toggle_telemetry_hud" = "Переключить компактный HUD телеметрии";

"camera.zoom_sensitivity" = "Чувствительность зума";
"camera.free_speed" = "Скорость свободной камеры";
"camera.distance" = "Дистанция камеры";
"camera.fpv_yaw_limit" = "Лимит FPV рыскания";
"camera.fpv_pitch_limit" = "Лимит FPV тангажа";
"camera.fpv_near_clip" = "FPV ближняя отсечка";
"camera.fpv_mount_x" = "FPV крепление X";
"camera.fpv_mount_y" = "FPV крепление Y";
"camera.fpv_mount_z" = "FPV крепление Z";
"camera.fpv_hide_obstructing" = "Скрывать мешающие части дрона в FPV";

"keybind.section.title" = "Назначения клавиш";
"keybind.open" = "Горячие клавиши";
"keybind.category.flight" = "Управление полетом";
"keybind.category.camera" = "Управление камерой";
"keybind.category.ui" = "Управление интерфейсом";
"keybind.category.debug" = "Отладка / наложения";
"keybind.flight.forward" = "Вперед";
"keybind.flight.backward" = "Назад";
"keybind.flight.left" = "Влево";
"keybind.flight.right" = "Вправо";
"keybind.flight.descend" = "Снижение";
"keybind.flight.ascend" = "Набор высоты";
"keybind.flight.yaw_left" = "Рыскание влево";
"keybind.flight.yaw_right" = "Рыскание вправо";
"keybind.flight.accelerate" = "Ускорение";
"keybind.flight.hover" = "Зависание / стабилизация";
"keybind.flight.reset" = "Сброс дрона";
"keybind.camera.mode1" = "Камера 1 (Свободная)";
"payload.select" = "Полезная нагрузка";
"payload.configure" = "Настройка ПН";
"payload.toolbar.open" = "Открыть модуль полезной нагрузки";
"payload.toolbar.close" = "Закрыть модуль полезной нагрузки";
"payload.section" = "НАСТРОЙКА ПН";
"payload.console.subtitle" = "Операционный модуль полезной нагрузки для активного профиля БЛА";
"payload.type" = "Тип ПН";
"payload.data_source" = "Источник данных ПН";
"payload.data.verified" = "ПРОВЕРЕНО";
"payload.data.estimated" = "ОЦЕНОЧНО";
"payload.data.custom" = "ВРУЧНУЮ";
"payload.data.estimated_hint" = "Часть ограничений рассчитана по консервативным оценочным данным модели.";
"payload.mass" = "Масса ПН";
"payload.custom_name" = "Название";
"payload.status" = "Статус ПН";
"payload.mount.title" = "Крепление";
"payload.mount.unavailable" = "НЕДОСТУПНО";
"payload.mount.ready" = "ГОТОВО";
"payload.mount.occupied" = "ЗАНЯТО";
"payload.limits.title" = "Ограничения БЛА";
"payload.base_mass" = "Масса БЛА";
"payload.battery_mass" = "Масса батареи";
"payload.max_payload" = "Лимит ПН";
"payload.max_takeoff" = "Макс. взлетная масса";
"payload.total_mass" = "Итоговая масса";
"payload.attach" = "Установить";
"payload.release" = "Сбросить";
"payload.remove" = "Снять";
"payload.mass_value" = "%.2f кг";
"payload.state.no_payload" = "НЕТ ПН";
"payload.state.attached" = "УСТАНОВЛЕНА";
"payload.state.removed" = "СНЯТА";
"payload.state.released" = "СБРОШЕНА";
"payload.state.falling" = "ПАДАЕТ";
"payload.state.landed" = "ПРИЗЕМЛЕНА";
"payload.state.cleaned_up" = "УБРАНА";
"payload.message.attached" = "Полезная нагрузка установлена";
"payload.message.released" = "Полезная нагрузка сброшена";
"payload.message.dropped_successfully" = "Сброс полезной нагрузки выполнен";
"payload.message.cleanup_completed" = "Сброшенная ПН удалена из сцены";
"payload.message.removed" = "Полезная нагрузка снята";
"payload.message.no_payload_attached" = "Полезная нагрузка не установлена";
"payload.message.select_uav" = "Сначала выберите БЛА";
"payload.message.payload_limit_exceeded" = "Масса ПН превышает лимит выбранного БЛА";
"payload.message.takeoff_limit_exceeded" = "Итоговая масса превышает максимальную взлетную массу";
"payload.message.data_unavailable" = "Для этого профиля БЛА нет достаточных данных по полезной нагрузке";
"payload.message.invalid_mass" = "Задайте массу ПН больше нуля";
"payload.type.cargo_box" = "Грузовой контейнер";
"payload.type.camera_gimbal" = "Камерный подвес";
"payload.type.thermal_camera" = "Тепловизионная камера";
"payload.type.lidar_module" = "Лидарный модуль";
"payload.type.rescue_pack" = "Спасательный комплект";
"payload.type.sensor_module" = "Сенсорный модуль";
"payload.type.radio_relay" = "Радиорелейный модуль";
"payload.type.custom" = "Пользовательская";
"payload.placeholder.message" = "Функция будет добавлена позже.";
"control_mode.angle" = "Угловой";
"command.arm" = "Армировать";
"command.disarm" = "Разармировать";
"telemetry.arm_state" = "Состояние армирования";
"arm_state.armed" = "Армирован";
"arm_state.disarmed" = "Разармлен";
"flight_state.disarmed" = "Разармлен";
"flight_state.armed_idle" = "Армирован, ожидание";
"flight_state.crashed" = "Крушение";
"warning.disarmed" = "Аппарат разармлен";
"warning.integrity_critical" = "Критическое повреждение конструкции";
"warning.crashed" = "Аппарат потерпел крушение";
"damage.severity.nominal" = "Норма";
"damage.severity.light" = "Легкие";
"damage.severity.medium" = "Средние";
"damage.severity.critical" = "Критические";
"keybind.camera.mode2" = "Камера 2 (Вид от хвоста)";
"keybind.camera.mode3" = "Камера 3 (Орбита)";
"keybind.camera.mode4" = "Камера 4 (FPV)";
"keybind.camera.mode5" = "Камера 5 (Вид сверху)";
"keybind.camera.mode6" = "Камера 6 (Падение ПН)";
"keybind.camera.toggle_fpv" = "Переключить FPV";
"keybind.camera.cycle_mode" = "Смена режима камеры";
"keybind.camera.zoom_in" = "Приблизить";
"keybind.camera.zoom_out" = "Отдалить";
"keybind.camera.yaw_left" = "Камера: влево";
"keybind.camera.yaw_right" = "Камера: вправо";
"keybind.camera.pitch_up" = "Камера: вверх";
"keybind.camera.pitch_down" = "Камера: вниз";
"keybind.camera.reset_orientation" = "Сброс ориентации камеры";
"workspace.toolstrip" = "Лента инструментов";
"toolstrip.tab.simulation" = "Симуляция";
"toolstrip.tab.flight" = "Полет";
"toolstrip.tab.camera" = "Камера";
"toolstrip.tab.environment" = "Окружение";
"toolstrip.tab.debug" = "Отладка";
"toolstrip.tab.projects" = "Проекты";
"toolstrip.section.run" = "Управление запуском";
"toolstrip.section.flight_model" = "Аппарат и режим";
"toolstrip.section.throttle" = "Тяга";
"toolstrip.section.camera_modes" = "Режимы камеры";
"toolstrip.section.camera_quick" = "Пресеты камеры";
"toolstrip.section.weather" = "Погода";
"toolstrip.section.terrain" = "Местность";
"toolstrip.section.debug" = "Диагностика";
"toolstrip.section.projects" = "Действия проекта";
"camera.zoom_in" = "Приблизить";
"camera.zoom_out" = "Отдалить";
"camera.reset_orientation" = "Сбросить вид";
"panel.collision_debug" = "Отладка коллизий";
"window.fullscreen" = "Полный экран";
"keybind.ui.toggle_panel" = "Свернуть / развернуть панель";
"keybind.ui.toggle_mission_map" = "Открыть / закрыть карту миссии";
"keybind.ui.toggle_payload" = "Открыть / закрыть полезную нагрузку";
"keybind.ui.toggle_hud" = "Переключить HUD телеметрии";
"keybind.flight.release_payload" = "Сбросить полезную нагрузку";
"keybind.debug.toggle_damage" = "Переключить оверлей повреждений";
"keybind.debug.toggle_thermal" = "Переключить тепловой оверлей";
"keybind.capture.idle" = "Выберите действие и нажмите переназначение.";
"keybind.capture.prompt" = "Нажмите клавишу для \"%@\" (Esc для отмены)";
"keybind.rebind" = "Переназначить";
"keybind.capturing" = "Ожидание…";
"keybind.reset_defaults" = "Сброс по умолчанию";
"keybind.key.space" = "Пробел";
"keybind.key.code" = "Клавиша %d";

"control_mode.title" = "Режим управления полетом";
"control_mode.stabilized" = "Стабилизированный";
"control_mode.acro" = "Акро";
"control_mode.hover_assist" = "Удержание высоты";

"common.export" = "Экспорт";

"camera.preset" = "Пресет камеры";
"camera.preset.cinematic" = "Кинематографичный";
"camera.preset.pilot" = "Пилот";
"camera.preset.inspection" = "Инспекция";
"camera.preset.wide_follow" = "Широкое следование";
"camera.preset.tight_follow" = "Близкое следование";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Сбросить к пресету";
"camera.advanced" = "Расширенные настройки камеры";
"camera.invert_x" = "Инвертировать X";
"camera.invert_y" = "Инвертировать Y";
"camera.sensitivity_profile" = "Профиль чувствительности";
"camera.sensitivity.low" = "Низкий";
"camera.sensitivity.medium" = "Средний";
"camera.sensitivity.high" = "Высокий";

"section.flight" = "Полет";
"section.camera" = "Камера";
"section.environment" = "Среда";
"section.diagnostics" = "Диагностика";
"section.advanced" = "Расширенные";

"diagnostic.last_collision_source" = "Источник последней коллизии";
"diagnostic.active_objects" = "Активные объекты";
"diagnostic.active_physics" = "Физические тела";
"diagnostic.active_particles" = "Частицы";

"telemetry.control_mode" = "Режим управления";
"telemetry.nearest_obstacle_source" = "Источник ближайшего препятствия";
"telemetry.frame_time" = "Кадр";
"telemetry.physics_time" = "Физика";
"telemetry.render_time" = "Рендер";
"telemetry.path_time" = "Планировщик";
"telemetry.active_objects" = "Объекты";
"telemetry.active_physics_bodies" = "Физические тела";
"telemetry.particle_count" = "Частицы";

"drone.model.fixed_rect" = "БПЛА с прямым крылом";
"drone.model.fixed_delta" = "БПЛА дельта-крыло";
"drone.model.fixed_swept" = "БПЛА со стреловидным крылом";
"drone.visual.fixed_rect" = "Самолётное семейство с прямым крылом";
"drone.visual.fixed_delta" = "Самолётное семейство типа «дельта»";
"drone.visual.fixed_swept" = "Самолётное семейство со стреловидным крылом";
"drone.camera.fixed_front" = "Фронтальная камера самолётного БПЛА";

"menu.title" = "Проекты БПЛА";
"menu.saved_projects" = "Сохраненные проекты";
"menu.create_project" = "Создать проект";
"menu.recent_project" = "Последний проект";
"menu.search" = "Поиск проекта";
"menu.sort" = "Сортировка";

"project.name" = "Имя проекта";
"project.sort.newest" = "Сначала новые";
"project.sort.name" = "По имени";
"project.sort.recent" = "Недавно открытые";
"project.create.title" = "Создание проекта";
"project.create.action" = "Создать";
"project.open.action" = "Открыть список проектов";
"project.open.failure" = "Не удалось открыть проект";
"project.save.action" = "Сохранить проект";
"project.save_as.action" = "Сохранить как";
"project.save_as.title" = "Сохранить проект как";
"project.save.success" = "Проект сохранен";
"project.save.failure" = "Ошибка сохранения проекта";
"project.duplicate.title" = "Дублировать проект";
"project.duplicate.action" = "Дублировать проект";
"project.duplicate.success" = "Проект продублирован";
"project.duplicate.failure" = "Ошибка дублирования проекта";
"project.delete.action" = "Удалить проект";
"project.delete.failure" = "Не удалось удалить проект";
"project.delete.confirm.title" = "Удаление проекта";
"project.delete.confirm.message" = "Удалить проект '%@'?";

"project.unsaved.title" = "Несохраненные изменения";
"project.unsaved.message" = "Сохранить проект '%@'?\nНесохраненные изменения могут быть потеряны.";
"project.unsaved.save" = "Сохранить";
"project.unsaved.save_exit" = "Сохранить и выйти";
"project.unsaved.exit_without" = "Выйти без сохранения";

"telemetry.export.select_folder" = "Выберите папку для экспорта файла телеметрии.";
"control_mode.acro" = "Акро / скоростной";
"control_mode.hover_assist" = "Зависание / удержание высоты";

"section.flight" = "Полет";
"section.camera" = "Камера";
"section.environment" = "Окружение";
"section.diagnostics" = "Диагностика";
"section.advanced" = "Расширенные";

"camera.preset" = "Пресет камеры";
"camera.preset.cinematic" = "Кинематограф";
"camera.preset.pilot" = "Пилот";
"camera.preset.inspection" = "Инспекция";
"camera.preset.wide_follow" = "Широкое следование";
"camera.preset.tight_follow" = "Плотное следование";
"camera.preset.fpv" = "FPV";
"camera.reset_to_preset" = "Сброс к пресету";
"camera.advanced" = "Расширенная камера";
"camera.sensitivity_profile" = "Профиль чувствительности";
"camera.sensitivity.low" = "Низкий";
"camera.sensitivity.medium" = "Средний";
"camera.sensitivity.high" = "Высокий";
"camera.invert_x" = "Инвертировать X";
"camera.invert_y" = "Инвертировать Y";

"diagnostic.last_collision_source" = "Источник последнего столкновения";
"diagnostic.active_objects" = "Активные объекты";
"diagnostic.active_physics" = "Активные физические тела";
"diagnostic.active_particles" = "Количество частиц";

"telemetry.control_mode" = "Режим управления";
"telemetry.nearest_obstacle_source" = "Источник ближайшего препятствия";
"telemetry.frame_time" = "Время кадра";
"telemetry.physics_time" = "Время физики";
"telemetry.render_time" = "Время рендера";
"telemetry.path_time" = "Время поиска пути";
"telemetry.active_objects" = "Активные объекты";
"telemetry.active_physics_bodies" = "Физические тела";
"telemetry.particle_count" = "Частицы";

"drone.model.fixed_rect" = "БПЛА с прямым крылом";
"drone.model.fixed_delta" = "БПЛА с дельта-крылом";
"drone.model.fixed_swept" = "БПЛА со стреловидным крылом";
"drone.model.ebee_class" = "Картографический БПЛА класса eBee";
"drone.model.ux11_class" = "Съёмочный БПЛА класса UX11";
"drone.model.wingtra_class" = "VTOL БПЛА класса Wingtra";
"drone.model.trinity_class" = "Профессиональный БПЛА класса Trinity";

"drone.visual.fixed_rect" = "Самолётное семейство с прямым крылом";
"drone.visual.fixed_delta" = "Самолётное семейство типа «дельта»";
"drone.visual.fixed_swept" = "Самолётное семейство со стреловидным крылом";
"drone.visual.ebee_class" = "Бесхвостая летающая платформа для картографии";
"drone.visual.ux11_class" = "Классический самолётный БПЛА для аэросъёмки";
"drone.visual.wingtra_class" = "VTOL fixed-wing типа tailsitter";
"drone.visual.trinity_class" = "Профессиональная survey eVTOL-платформа";

"drone.camera.fixed_front" = "Фронтальная камера самолётного БПЛА";

"common.not_specified" = "Не указано";

"country.china" = "Китай";
"country.united_states" = "США";
"country.norway" = "Норвегия";
"country.switzerland" = "Швейцария";
"country.germany" = "Германия";
"country.israel" = "Израиль";
"country.poland" = "Польша";
"country.canada" = "Канада";
"country.user_defined" = "Задано пользователем";

"uav.filter.type" = "Тип";
"uav.filter.mass" = "Масса";
"uav.filter.vehicle.all" = "Все";
"uav.filter.vehicle.multicopters" = "Мультикоптеры";
"uav.filter.vehicle.helicopters" = "Вертолетные";
"uav.filter.vehicle.fixed_wing" = "Самолетные";
"uav.filter.vehicle.hybrid_vtol" = "Гибриды VTOL";
"uav.filter.mass.all" = "Все";
"uav.filter.mass.nano" = "Нано";
"uav.filter.mass.micro" = "Микро";
"uav.filter.mass.light" = "Легкие";
"uav.filter.mass.medium" = "Средние";
"uav.filter.mass.heavy" = "Тяжелые";

"uav.vehicle.multicopter" = "Мультикоптер";
"uav.vehicle.fixed_wing" = "Самолетный";
"uav.vehicle.hybrid_vtol" = "Гибрид VTOL";
"uav.vehicle.helicopter" = "Вертолетный";
"uav.vehicle.custom" = "Пользовательский";

"uav.mass.nano" = "Нано";
"uav.mass.micro" = "Микро";
"uav.mass.light" = "Легкий";
"uav.mass.medium" = "Средний";
"uav.mass.heavy" = "Тяжелый";
"uav.mass.custom" = "Пользовательский";

"uav.spec.verified" = "Проверен";
"uav.spec.partial" = "Частичный";
"uav.spec.custom" = "Пользовательский";

"uav.badge.custom" = "КАСТОМ";
"uav.catalog.title" = "Каталог БЛА";
"uav.catalog.empty" = "Нет профилей БЛА, соответствующих текущим фильтрам.";
"uav.catalog.edit_abstract" = "Редактировать абстрактный БЛА";
"uav.catalog.selected_outside_filter" = "Выбранная модель не входит в текущий фильтр";

"uav.card.title" = "Выбранный БЛА";
"uav.card.manufacturer" = "Производитель";
"uav.card.country" = "Страна";
"uav.card.type" = "Тип";
"uav.card.mass_class" = "Массовый класс";
"uav.card.base_mass" = "Масса БЛА";
"uav.card.max_payload" = "Макс. полезная нагрузка";
"uav.card.mtow" = "Макс. взлетная масса";
"uav.card.role" = "Роль";
"uav.card.status" = "Статус";
"uav.card.payload_data_source" = "Данные ПН";
"uav.card.armament_note" = "Примечание по вооружению";
"uav.card.empty" = "Профиль БЛА не выбран";

"uav.manufacturer.custom" = "Пользовательский";

"uav.profile.abstract-uav.display_name" = "Абстрактный БЛА";
"uav.profile.dji-matrice-350-rtk.short_description" = "Промышленный квадрокоптер с шасси, центральным отсеком подвеса и поддержкой модульной полезной нагрузки.";
"uav.profile.dji-matrice-350-rtk.mission_role" = "Инспекция, картография и задачи общественной безопасности";
"uav.profile.dji-flycart-30.short_description" = "Тяжелый грузовой мультикоптер с коаксиальными подъемными группами и центральным нижним грузовым отсеком.";
"uav.profile.dji-flycart-30.mission_role" = "Грузовая доставка и логистика";
"uav.profile.dji-mavic-4-pro.short_description" = "Складной потребительский мультикоптер с трехкамерным передним подвесом.";
"uav.profile.dji-mavic-4-pro.mission_role" = "Потребительская аэросъемка и съемка для создателей контента";
"uav.profile.dji-neo.short_description" = "Сверхкомпактный мультикоптер с защитой пропеллеров для роли легкой персональной летающей камеры.";
"uav.profile.dji-neo.mission_role" = "Персональная аэросъемка";
"uav.profile.dji-phantom-3-standard.short_description" = "Классический квадрокоптер Phantom со встроенным шасси и передним отсеком подвеса камеры.";
"uav.profile.dji-phantom-3-standard.mission_role" = "Потребительская аэросъемка";
"uav.profile.freefly-alta-x.short_description" = "Тяжелый мультикоптер с открытой рамой для кино- и индустриальных задач и центральной нижней секцией полезной нагрузки.";
"uav.profile.freefly-alta-x.mission_role" = "Тяжелая кино- и индустриальная перевозка полезной нагрузки";
"uav.profile.griff-30.short_description" = "Тяжелый грузовой БЛА с крупной транспортной рамой и нижней зоной подвеса груза.";
"uav.profile.griff-30.mission_role" = "Тяжелая грузовая перевозка";
"uav.profile.griff-60.short_description" = "Крупный тяжелый грузовой БЛА с более грузоподъемной рамой, чем у Griff 30.";
"uav.profile.griff-60.mission_role" = "Тяжелая грузовая перевозка";
"uav.profile.avidrone-490tl.short_description" = "Грузовой БЛА вертолетного типа с тандемными роторами, вытянутым фюзеляжем и нижней грузовой позицией.";
"uav.profile.avidrone-490tl.mission_role" = "Грузовая перевозка и утилитарный подъем";
"uav.profile.wingtraone-gen-ii.short_description" = "Гибридный картографический VTOL-самолет с нижним отсеком съемочного оборудования и крейсерской самолетной схемой.";
"uav.profile.wingtraone-gen-ii.mission_role" = "Картографическая съемка и фотограмметрия";
"uav.profile.quantum-systems-trinity-pro.short_description" = "Дальнопролетный eVTOL-самолет для съемки с центральным сенсорным отсеком под фюзеляжем.";
"uav.profile.quantum-systems-trinity-pro.mission_role" = "Картография и инспекция линейных объектов";
"uav.profile.mq-9b-skyguardian.short_description" = "Крупная платформа MALE самолетного типа с длинным крылом, носовой сенсорной архитектурой и многоточечной полезной нагрузкой.";
"uav.profile.mq-9b-skyguardian.mission_role" = "Длительное ISR-наблюдение и многоцелевая патрульная работа";
"uav.profile.hermes-900.short_description" = "Многоцелевая платформа MALE с длинным крылом, толкающей схемой и сенсорными станциями под носом и фюзеляжем.";
"uav.profile.hermes-900.mission_role" = "Многоцелевая ISR-разведка и морское патрулирование";
"uav.profile.ft5-los.short_description" = "Двухдвигательная тактическая самолетная платформа с компактным разведывательным планером и модульной интеграцией полезной нагрузки.";
"uav.profile.ft5-los.mission_role" = "Тактическая разведка и ISTAR";
"uav.profile.flyeye.short_description" = "Легкий самолетный разведывательный БЛА с компактным фюзеляжем и нижней электрооптической полезной нагрузкой.";
"uav.profile.flyeye.mission_role" = "Ближняя разведка и наблюдение";
"uav.profile.abstract-uav.short_description" = "Пользовательский профиль БЛА для будущей настройки параметров.";
"uav.profile.abstract-uav.mission_role" = "Пользовательская задача";

"telemetry.path_status" = "Статус маршрута";
"telemetry.path_status.idle" = "Ожидание";
"telemetry.path_status.valid" = "Готов";
"telemetry.path_status.recomputing" = "Перестроение";
"telemetry.path_status.blocked" = "Заблокирован";
"telemetry.auto_nav" = "Автонавигация";
"telemetry.auto_nav.active" = "ВКЛ";
"telemetry.auto_nav.inactive" = "ВЫКЛ";
"telemetry.control_authority" = "Источник управления";
"telemetry.input_flags" = "Флаги ввода";
"telemetry.state_flags" = "Флаги состояния";
"common.on" = "ВКЛ";
"common.off" = "ВЫКЛ";
"telemetry.target_distance" = "Дист. до цели";
"telemetry.target_bearing" = "Пеленг на цель";
"telemetry.waypoint" = "Маршрутная точка";
"telemetry.waypoint.value" = "индекс %d, осталось %d";
"telemetry.path_remaining" = "Остаток маршрута";

"panel.modules.on" = "Модули: Вкл";
"panel.modules.off" = "Модули: Выкл";

"toolbar.cluster.status" = "Текущий статус";
"toolbar.cluster.status.subtitle" = "Текущий контур управления и активный модуль";
"toolbar.cluster.project" = "Действия проекта";
"toolbar.cluster.project.subtitle" = "Сохранение сессии и управление окном";
"toolbar.cluster.utility" = "Инструменты оператора";
"toolbar.cluster.utility.subtitle" = "Горячие клавиши, HUD и язык";

"sidebar.metric.mode" = "Режим";
"sidebar.metric.state" = "Состояние";
"sidebar.metric.camera" = "Камера";
"sidebar.metric.platform" = "Платформа";
"sidebar.metric.battery" = "Батарея";
"sidebar.metric.warnings" = "Предупреждения";
"sidebar.metric.throttle" = "Тяга";
"sidebar.metric.preset" = "Пресет";
"sidebar.metric.fov" = "Угол обзора";
"sidebar.metric.distance" = "Дистанция";
"sidebar.metric.weather" = "Погода";
"sidebar.metric.terrain" = "Рельеф";
"sidebar.metric.wind" = "Ветер";
"sidebar.metric.boundary" = "Контур";
"sidebar.metric.manufacturer" = "Производитель";
"sidebar.value.on" = "Вкл";
"sidebar.value.off" = "Выкл";

"toolbar.header.project" = "Действия проекта";

"module.panel.idle" = "МОДУЛИ";
"module.panel.idle.subtitle" = "Выберите инструмент на панели, чтобы открыть рабочий модуль";

"module.flight_ops.title" = "ПОЛЕТНЫЕ ОПЕРАЦИИ";
"module.flight_ops.toolbar_title" = "Полет";
"module.flight_ops.subtitle" = "Запуск, возврат и управление тягой";
"module.flight_ops.command_stack" = "Блок команд";
"module.flight_ops.command_stack.subtitle" = "Основные действия аппарата и автоматические режимы";
"module.flight_ops.control_law" = "Режим управления";
"module.flight_ops.control_law.subtitle" = "Переключение законов управления без выхода из сцены";
"module.flight_ops.active_mode" = "АКТИВЕН";
"module.flight_ops.thrust" = "Канал тяги";
"module.flight_ops.thrust.subtitle" = "Прямая тяга и фиксированные уставки";
"module.flight_ops.override" = "Безопасность / Сброс";
"module.flight_ops.override.subtitle" = "Питание симуляции, восстановление и аварийный стоп";

"module.uav_catalog.title" = "КАТАЛОГ БЛА";
"module.uav_catalog.toolbar_title" = "БЛА";
"module.uav_catalog.subtitle" = "Выбор платформы и активного профиля";
"module.uav_catalog.selection" = "Сводка платформ";
"module.uav_catalog.selection.subtitle" = "Состояние фильтра и текущего выбора";
"module.uav_catalog.metric.active" = "Активный профиль";
"module.uav_catalog.metric.filtered" = "После фильтра";
"module.uav_catalog.metric.type" = "Тип аппарата";
"module.uav_catalog.metric.mass" = "Массовый класс";
"module.uav_catalog.list.subtitle" = "Фильтры каталога, список платформ и карточка профиля";

"module.payload.title" = "ПОЛЕЗНАЯ НАГРУЗКА";
"module.payload.toolbar_title" = "ПН";

"module.camera.title" = "КАМЕРА";
"module.camera.toolbar_title" = "Камера";
"module.camera.subtitle" = "Ракурс, оптика и FPV-настройка";
"module.camera.mode_stack" = "Режимы камеры";
"module.camera.mode_stack.subtitle" = "Рабочие режимы наблюдения за сценой";
"module.camera.active_mode" = "В РАБОТЕ";
"module.camera.presets" = "Набор пресетов";
"module.camera.presets.subtitle" = "Миссионные пресеты и быстрый сброс вида";
"module.camera.optics" = "Оптика";
"module.camera.optics.subtitle" = "Дистанция камеры и угол обзора";
"module.camera.advanced.subtitle" = "Раскрывать только при необходимости глубокой настройки";
"module.camera.show_advanced" = "Показать расширенную настройку камеры";
"module.camera.hide_advanced" = "Скрыть расширенную настройку камеры";
"module.camera.fpv_stack" = "Параметры FPV";
"module.camera.preset_hint.cinematic" = "Широкий и плавный ракурс для презентационного полета";
"module.camera.preset_hint.pilot" = "Сбалансированный операторский вид для общего пилотажа";
"module.camera.preset_hint.inspection" = "Более близкое кадрирование для осмотра объектов";
"module.camera.preset_hint.wide_follow" = "Увеличенная дистанция следования для обстановки";
"module.camera.preset_hint.tight_follow" = "Плотное следование для точной работы";
"module.camera.preset_hint.fpv" = "Кокпитный вид с прямой осью наблюдения";

"module.scenario.title" = "СЦЕНАРИЙ";
"module.scenario.toolbar_title" = "Сценарий";
"module.scenario.subtitle" = "Погода, местность и габариты рабочей зоны";
"module.scenario.weather" = "Погодный профиль";
"module.scenario.weather.subtitle" = "Пресеты и интенсивность внешних условий";
"module.scenario.show_weather_tuning" = "Показать параметры ветра";
"module.scenario.hide_weather_tuning" = "Скрыть параметры ветра";
"module.scenario.active_preset" = "АКТИВЕН";
"module.scenario.terrain" = "Профиль местности";
"module.scenario.terrain.subtitle" = "Масштаб карты, плотность и граничный контур";
"module.scenario.active_profile" = "АКТИВЕН";

"module.diagnostics.title" = "ДИАГНОСТИКА";
"module.diagnostics.toolbar_title" = "Диагностика";
"module.diagnostics.subtitle" = "Телеметрия, системные состояния и техническое состояние";
"module.diagnostics.overlay" = "Режимы наложения";
"module.diagnostics.overlay.subtitle" = "Служебные слои и диагностическая видимость";
"module.diagnostics.runtime_summary" = "Системная сводка";
"module.diagnostics.runtime_summary.subtitle" = "Счетчики кадра, физики, рендера и объектной нагрузки";
"module.diagnostics.telemetry" = "Блок телеметрии";
"module.diagnostics.telemetry.subtitle" = "Расширенный вывод миссии, питания и производительности";
"module.diagnostics.warning_bus" = "Лента предупреждений";
"module.diagnostics.warning_bus.subtitle" = "Текущие тревоги от полета, батареи и среды";
"module.diagnostics.fleet" = "Координация группы";
"module.diagnostics.fleet.subtitle" = "Поведение ведомых и дистанция строя";
"module.diagnostics.damage" = "Повреждения / Тепло";
"module.diagnostics.damage.subtitle" = "Видимость компонентов и контроль целостности";
"module.diagnostics.station" = "Станционные настройки";
"module.diagnostics.station.subtitle" = "Язык оператора и локальные параметры рабочего места";
"module.diagnostics.panel.overview" = "Обзор";
"module.diagnostics.panel.telemetry" = "Телеметрия";
"module.diagnostics.panel.fleet" = "Группа";
"module.diagnostics.panel.service" = "Сервис";

"project.default_name" = "Проект %@";
"project.copy_suffix" = "копия";
"project.clone_suffix" = "дубликат";

"control_authority.none" = "НЕТ";
"control_authority.manual" = "РУЧНОЕ";
"control_authority.marker" = "МЕТКА";
"control_authority.failsafe" = "АВАРИЙНЫЙ";
"control_authority.blocked" = "БЛОК";

"payload_camera.state.inactive" = "ВЫКЛ";
"payload_camera.state.falling" = "ПАДЕНИЕ";
"payload_camera.state.impact" = "УДАР";
"payload_camera.state.rest" = "ПОКОЙ";

"overlay.payload_view.title" = "КАМЕРА ПН";
"overlay.payload_view.metric.alt" = "ВЫС";
"overlay.payload_view.metric.vertical_speed" = "V/S";
"overlay.payload_view.metric.time" = "ВРЕМ";
"overlay.payload_view.metric.state" = "СТАТ";

"overlay.terrain_map.title" = "КАРТА МЕСТНОСТИ";
"overlay.terrain_map.subtitle" = "Обзор препятствий и одиночная целевая метка";
"overlay.terrain_map.clear" = "СБР";
"overlay.terrain_map.target_metrics.empty" = "ДИСТ —   ПЕЛ —";
"overlay.terrain_map.target_metrics.format" = "ДИСТ %.1f м   ПЕЛ %03.0f°";
"overlay.terrain_map.heading_alt_objects.format" = "КУР %@°   ВЫС %.1f м   ОБЪ %d";
"overlay.terrain_map.position_map.format" = "X %+.1f   Z %+.1f   КАРТА %@";
"overlay.terrain_map.status.format" = "СИГ %@   АВТОНАВ %@";

"overlay.compass.title" = "КОМПАС";
"overlay.compass.subtitle" = "Курс / север / пеленг цели";
"overlay.compass.metric.heading" = "КУР";
"overlay.compass.metric.north" = "С";
"overlay.compass.metric.bearing" = "ПЕЛ";
"overlay.compass.marker.current" = "КУР";
"overlay.compass.marker.target" = "ЦЕЛ";

"hud.compact.position" = "ПОЗ  x %.1f  y %.1f  z %.1f";
"hud.compact.speed_battery" = "СКР  %.1f м/с   АКБ %.0f%%";
"hud.compact.auto_nav" = "АВТО %@  ДИСТ %@  ПЕЛ %@";

"telemetry.flags.input.format" = "РУЧ %@ | МЕТ %@ | ПН %@ | КАРТ %@";
"telemetry.flags.state.format" = "РАЗ %@ | БЛК %@ | СИГ %@";
"telemetry.flags.mission.format" = "КАРТ %@ | ЗС %@ | ГОТ %@ | В %@ | СБР %@";

"tactical.map.title" = "ТАКТИЧЕСКАЯ КАРТА";
"tactical.map.subtitle" = "Черновик, план и запуск миссии поверх существующего автопилота.";
"tactical.map.mode.waypoint" = "ТОЧКИ";
"tactical.map.mode.drop_zone" = "ЗОНА СБРОСА";
"tactical.map.mode.no_fly_zone" = "NO-FLY";
"tactical.map.instruction.waypoint" = "Кликните по карте, чтобы добавить следующую точку маршрута.";
"tactical.map.instruction.drop_zone" = "Кликните по карте, чтобы поставить или переместить зону сброса.";
"tactical.map.instruction.no_fly_zone" = "Кликните по карте, чтобы поставить ещё одну запретную зону.";
"tactical.map.section.status" = "СТАТУС ЧЕРНОВИКА";
"tactical.map.section.route" = "PREVIEW МАРШРУТА";
"tactical.map.section.zones" = "ЗОНЫ";
"tactical.map.section.actions" = "ДЕЙСТВИЯ";
"tactical.map.zone.drop_zone" = "Зона сброса";
"tactical.map.zone.no_fly_zone" = "Запретная зона";
"tactical.map.zone.empty" = "Зона не задана.";
"tactical.map.zone.radius.value" = "%.1f м | x %.1f | y %.1f";
"tactical.map.zone.radius.value.multiple" = "%.1f м | x %.1f | y %.1f | зон %d";
"tactical.map.metric.span" = "КАРТА";
"tactical.map.metric.route_distance" = "МАРШРУТ";
"tactical.map.metric.waypoints" = "ТОЧКИ";
"tactical.map.metric.zones" = "ЗОНЫ";
"tactical.map.metric.segments" = "СЕГМЕНТЫ";
"tactical.map.preview.none" = "Нет preview";
"tactical.map.route.empty" = "Черновик маршрута пуст.";
"tactical.map.badge.draft_dirty" = "ЧЕРНОВИК ИЗМЕНЁН";
"tactical.map.badge.draft_synced" = "ЧЕРНОВИК СОХРАНЁН";
"tactical.map.action.save_draft" = "СОХРАНИТЬ";
"tactical.map.action.cancel" = "ОТМЕНИТЬ";
"tactical.map.action.exit" = "ВЫЙТИ";
"tactical.map.action.remove_last_waypoint" = "УДАЛИТЬ ПОСЛЕДНЮЮ ТОЧКУ";
"tactical.map.action.clear_route" = "ОЧИСТИТЬ МАРШРУТ";
"tactical.map.action.clear_zones" = "ОЧИСТИТЬ ЗОНЫ";
"tactical.map.status.empty.title" = "Черновик пуст";
"tactical.map.status.empty.detail" = "Добавьте хотя бы одну точку маршрута, чтобы построить preview.";
"tactical.map.status.preview_unavailable.title" = "Preview недоступен";
"tactical.map.status.preview_unavailable.detail" = "Черновик ещё не готов. Карта не публикует preview-маршрут.";
"tactical.map.status.invalid.title" = "Черновик невалиден";
"tactical.map.status.invalid.detail" = "В черновике есть блокирующие ошибки. Маршрут не сохранён.";
"tactical.map.status.ready.title" = "Preview готов";
"tactical.map.status.ready.detail" = "Черновик структурно корректен. Preview маршрута и зоны готовы к проверке оператором.";
"tactical.map.issue.none" = "Блокирующих проблем нет.";
"tactical.map.issue.route_missing" = "Добавьте хотя бы одну точку маршрута перед сохранением черновика.";
"tactical.map.issue.waypoint_out_of_bounds" = "Одна или несколько точек находятся вне рабочей зоны связи.";
"tactical.map.issue.waypoint_spacing" = "Соседние точки маршрута расположены слишком близко друг к другу.";
"tactical.map.issue.zone_radius_invalid" = "Радиус одной из зон выходит за допустимый инженерный диапазон.";
"tactical.map.issue.zone_out_of_bounds" = "Одна из зон выходит за рабочую зону связи.";
"tactical.map.issue.route_intersects_no_fly" = "Маршрут миссии пересекает хотя бы одну запретную зону.";
"tactical.map.issue.invalid_altitude_window" = "Ограничения по высоте заданы некорректно: минимальная высота не должна превышать максимальную.";
"tactical.map.issue.target_altitude_out_of_range" = "Расчётная высота выполнения миссии выходит за заданный диапазон.";
"tactical.map.issue.invalid_speed_window" = "Ограничения по скорости заданы некорректно или выходят за возможности текущего БЛА.";
"mission.plan.status.draft" = "Черновик";
"mission.plan.status.invalid" = "Невалидно";
"mission.plan.status.ready" = "Готово";
"mission.plan.status.validated" = "Validated";
"mission.binding.status.unbound" = "Не привязан";
"mission.binding.status.bound" = "Привязан";
"mission.binding.status.failed" = "Сбой";
"mission.execution.readiness.draft" = "Черновик";
"mission.execution.readiness.validated" = "Validated";
"mission.execution.readiness.unbound" = "Не привязан";
"mission.execution.readiness.ready" = "Ready";
"mission.execution.readiness.failed" = "Binding failure";
"mission.readiness.draft" = "Черновик";
"mission.readiness.invalid" = "Невалидно";
"mission.readiness.blocked" = "Блок";
"mission.readiness.ready" = "Готов";
"mission.execution.status.idle" = "Ожидание";
"mission.execution.status.ready" = "Подготовлено";
"mission.execution.status.running" = "Выполняется";
"mission.execution.status.paused" = "Пауза";
"mission.execution.status.completed" = "Завершено";
"mission.execution.status.aborted" = "Прервано";
"mission.execution.status.blocked" = "Заблокировано";
"mission.execution.status.failed" = "Сбой";
"mission.execution.status.no_authority" = "Нет authority";
"mission.truth.status.draft" = "Черновик";
"mission.truth.status.invalid" = "Невалидно";
"mission.truth.status.validated" = "Validated";
"mission.truth.status.execution_unbound" = "Нет contour";
"mission.truth.status.blocked" = "Блок";
"mission.truth.status.ready" = "Готово";
"mission.truth.status.running" = "Выполняется";
"mission.truth.status.paused" = "Пауза";
"mission.truth.status.returning_home" = "Возврат";
"mission.truth.status.completed" = "Завершено";
"mission.truth.status.aborted" = "Прервано";
"mission.truth.status.failed" = "Сбой";
"mission.truth.status.no_authority" = "Нет authority";
"mission.truth.status.no_target" = "Нет цели";
"mission.truth.status.route_invalid" = "Маршрут";
"mission.truth.status.runtime_distance_unavailable" = "Нет дистанции";
"mission.truth.status.failed_binding" = "Binding failure";
"mission.truth.status.runtime_unsafe" = "Небезопасно";
"mission.failsafe.none" = "Нет";
"mission.failsafe.hold" = "HOLD";
"mission.failsafe.pause" = "Пауза";
"mission.failsafe.abort" = "Abort";
"mission.failsafe.return_home" = "Возврат";
"mission.status.reason.draft_empty" = "Черновик миссии пуст.";
"mission.status.reason.no_validated_plan" = "Validated mission plan отсутствует.";
"mission.status.reason.preview_unavailable" = "Preview маршрута недоступен. План миссии пока нельзя подготовить.";
"mission.status.reason.route_missing" = "В миссии нет точек маршрута.";
"mission.status.reason.route_invalid" = "Маршрут миссии содержит невалидные или нулевые сегменты.";
"mission.status.reason.zone_invalid" = "Одна или несколько зон миссии невалидны.";
"mission.status.reason.plan_not_prepared" = "Черновик сохранён, но execution-план ещё не подготовлен.";
"mission.status.reason.plan_not_ready" = "План миссии не готов к запуску.";
"mission.status.reason.execution_contour_missing" = "Validated mission plan есть, но execution contour ещё не собран.";
"mission.status.reason.execution_binding_failed" = "Mission plan валиден, но execution binding завершился с ошибкой.";
"mission.status.reason.execution_not_started" = "План подготовлен и ждёт команды Start.";
"mission.status.reason.invalid_altitude_window" = "Ограничения миссии по высоте заданы некорректно.";
"mission.status.reason.invalid_speed_window" = "Ограничения миссии по скорости заданы некорректно.";
"mission.status.reason.target_altitude_out_of_range" = "Высота выполнения миссии выходит за заданный диапазон.";
"mission.status.reason.altitude_constraints_applied" = "Ограничения по высоте приняты и применяются к расчётной высоте выполнения миссии.";
"mission.status.reason.speed_max_constraint_applied" = "Максимальная скорость миссии принята и применяется через масштабирование команд автопилота.";
"mission.status.reason.speed_min_constraint_advisory" = "Минимальная скорость миссии принята как operational advisory, но baseline-автопилот пока не гарантирует её строго на каждом контуре.";
"mission.status.reason.no_active_execution_target" = "Execution contour есть, но активная mission target не назначена.";
"mission.status.reason.no_mission_target" = "Mission layer не имеет активной цели для передачи в autopilot.";
"mission.status.reason.runtime_distance_unavailable" = "Execution contour есть, но runtime distance до активной цели недоступна.";
"mission.status.reason.no_target_bound" = "Во время mission execution нет активной цели, привязанной к автопилоту.";
"mission.status.reason.no_control_authority" = "Цель миссии привязана, но текущий autopilot contour не владеет control authority.";
"mission.status.reason.authority_flap_detected" = "Authority кратковременно дрогнул и восстановился до подтверждённой потери. Выполнение продолжается.";
"mission.status.reason.runtime_stall_detected" = "Прогресс миссии не меняется слишком долго. Execution выглядит застрявшим.";
"mission.status.reason.battery_unsafe" = "Battery/runtime reserve недостаточен для безопасного продолжения миссии.";
"mission.status.reason.mission_start_blocked" = "Старт миссии заблокирован текущим safety/runtime состоянием.";
"mission.status.reason.mission_aborted_by_safety" = "Миссия прервана safety coordinator.";
"mission.status.reason.mission_paused_by_operator" = "Миссия поставлена на паузу оператором.";
"mission.status.reason.mission_paused_by_runtime" = "Миссия поставлена на паузу runtime safety layer.";
"mission.status.reason.return_home_triggered" = "Mission execution остановлен, запущен возврат домой.";
"mission.status.reason.runtime_unsafe" = "Runtime состояние признано небезопасным для mission execution.";
"mission.status.reason.unknown_runtime_mismatch" = "Mission layer и реальный autopilot contour рассогласованы.";
"mission.status.reason.execution_blocked" = "Миссию нельзя запустить или возобновить, пока БЛА не сможет принять target-marker auto-navigation.";
"mission.status.reason.waypoint_reached" = "Точка достигнута. Переключаемся на следующую цель.";
"mission.status.reason.mission_paused" = "Миссия поставлена на паузу. Текущая цель сохранена, но guidance не выполняется.";
"mission.status.reason.mission_completed" = "Миссия завершена. Все точки достигнуты.";
"mission.status.reason.mission_aborted" = "Миссия прервана оператором.";
"mission.status.reason.mission_failed" = "Миссия завершилась с ошибкой.";
"mission.status.field.control" = "КОНТУР";
"mission.status.field.active_target" = "ЦЕЛЬ";
"mission.status.field.distance" = "ДИСТ";
"mission.status.field.progress" = "ПРОГРЕСС";
"mission.status.field.plan" = "ПЛАН";
"mission.status.field.execution" = "EXEC";
"mission.status.field.validated_plan" = "VALIDATED";
"mission.status.field.binding" = "BIND";
"mission.status.field.execution_contour" = "CONTOUR";
"mission.status.field.execution_target" = "TARGET SRC";
"mission.status.field.runtime_distance" = "DIST SRC";
"mission.status.field.start_permission" = "START";
"mission.status.field.truth" = "TRUTH";
"mission.status.field.readiness" = "ГОТОВНОСТЬ";
"mission.status.field.authority_state" = "AUTH";
"mission.status.field.failsafe" = "FAILSAFE";
"mission.status.value.present" = "Есть";
"mission.status.value.absent" = "Нет";
"mission.status.value.bound" = "Да";
"mission.status.value.unbound" = "Нет";
"mission.status.value.available" = "Есть";
"mission.status.value.unavailable" = "Нет";
"mission.status.value.granted" = "Да";
"mission.status.value.blocked" = "Блок";
"mission.status.value.none" = "Нет";
"mission.status.chip.prepare" = "PREP";
"mission.status.chip.start" = "START";
"mission.status.chip.bound" = "BOUND";
"mission.status.chip.failsafe" = "SAFE";
"mission.authority.state.idle" = "Не требуется";
"mission.authority.state.mission" = "Mission owner";
"mission.authority.state.flap" = "Authority flap";
"mission.authority.state.target_lost" = "Цель потеряна";
"mission.authority.state.lost" = "Authority lost";
"mission.panel.section.status" = "СТАТУС МИССИИ";
"mission.panel.section.constraints" = "ОГРАНИЧЕНИЯ МИССИИ";
"mission.panel.section.execution" = "ВЫПОЛНЕНИЕ МИССИИ";
"mission.constraints.altitude.minimum" = "Минимальная высота";
"mission.constraints.altitude.maximum" = "Максимальная высота";
"mission.constraints.speed.minimum" = "Минимальная скорость";
"mission.constraints.speed.maximum" = "Максимальная скорость";
"mission.constraints.unit.meters" = "м";
"mission.constraints.unit.speed" = "м/с";
"mission.constraints.hint" = "Ограничения живут в состоянии миссии, валидируются перед запуском и передаются в слой автопилота там, где это поддерживает текущий baseline contour.";
"mission.panel.plan.summary" = "%d точек | %d route-point";
"mission.panel.plan.empty" = "План миссии не подготовлен.";
"mission.panel.action.prepare" = "ПОДГОТОВИТЬ МИССИЮ";
"mission.panel.action.start" = "СТАРТ";
"mission.panel.action.pause" = "ПАУЗА";
"mission.panel.action.resume" = "ПРОДОЛЖИТЬ";
"mission.panel.action.abort" = "ПРЕРВАТЬ";
"module.diagnostics.mission" = "КОНТУР МИССИИ";
"module.diagnostics.mission.subtitle" = "Truth status, safety, authority и failsafe причины.";
"module.diagnostics.mission_history" = "ТАЙМЛАЙН МИССИИ";
"module.diagnostics.mission_history.subtitle" = "Структурированный журнал событий и post-flight debrief по текущей миссии.";
"mission.event.category.planning" = "ПЛАН";
"mission.event.category.operator" = "ОПЕРАТОР";
"mission.event.category.execution" = "EXEC";
"mission.event.category.safety" = "SAFETY";
"mission.event.category.failsafe" = "FAILSAFE";
"mission.event.category.payload" = "PAYLOAD";
"mission.event.category.diagnostics" = "DIAG";
"mission.event.severity.info" = "INFO";
"mission.event.severity.warning" = "WARNING";
"mission.event.severity.critical" = "CRITICAL";
"mission.event.code.missionDraftPrepared" = "ЧЕРНОВИК ГОТОВ";
"mission.event.code.missionValidated" = "МИССИЯ ВАЛИДИРОВАНА";
"mission.event.code.missionStartRequested" = "ЗАПРОС СТАРТА";
"mission.event.code.missionStarted" = "МИССИЯ ЗАПУЩЕНА";
"mission.event.code.controlAuthorityGranted" = "AUTHORITY OK";
"mission.event.code.controlAuthorityLost" = "AUTHORITY LOST";
"mission.event.code.controlAuthorityFlap" = "AUTHORITY FLAP";
"mission.event.code.waypointActivated" = "АКТИВНАЯ ТОЧКА";
"mission.event.code.waypointReached" = "ТОЧКА ДОСТИГНУТА";
"mission.event.code.segmentCompleted" = "СЕГМЕНТ ЗАВЕРШЁН";
"mission.event.code.missionPaused" = "МИССИЯ НА ПАУЗЕ";
"mission.event.code.missionResumed" = "МИССИЯ ПРОДОЛЖЕНА";
"mission.event.code.missionBlocked" = "МИССИЯ ЗАБЛОКИРОВАНА";
"mission.event.code.missionWarningRaised" = "ПРЕДУПРЕЖДЕНИЕ";
"mission.event.code.runtimeUnsafeDetected" = "RUNTIME UNSAFE";
"mission.event.code.failsafeTriggered" = "FAILSAFE";
"mission.event.code.returnHomeTriggered" = "ВОЗВРАТ ДОМОЙ";
"mission.event.code.missionAborted" = "МИССИЯ ПРЕРВАНА";
"mission.event.code.missionCompleted" = "МИССИЯ ЗАВЕРШЕНА";
"mission.event.code.debriefGenerated" = "DEBRIEF ГОТОВ";
"mission.event.code.payloadActionTriggered" = "PAYLOAD ACTION";
"mission.event.code.payloadActionCompleted" = "PAYLOAD DONE";
"mission.event.code.diagnosticsCritical" = "DIAGNOSTICS CRITICAL";
"mission.event.detail.missionDraftPrepared" = "Черновик миссии подготовлен к проверке execution.";
"mission.event.detail.missionValidated" = "План миссии прошёл валидацию и готов к подготовке execution.";
"mission.event.detail.missionStartRequested" = "Оператор запросил старт миссии.";
"mission.event.detail.missionStarted" = "Mission execution перешёл в running.";
"mission.event.detail.controlAuthorityGranted" = "Mission layer владеет target authority над autopilot contour.";
"mission.event.detail.controlAuthorityFlap" = "Authority кратко пропал и восстановился в пределах safety grace window.";
"mission.event.detail.controlAuthorityLost" = "Mission layer потерял target authority и больше не гарантирует execution.";
"mission.event.detail.waypointActivated" = "Новая точка маршрута стала активной целью.";
"mission.event.detail.waypointReached" = "Активная точка маршрута достигнута.";
"mission.event.detail.segmentCompleted" = "Текущий сегмент маршрута завершён.";
"mission.event.detail.missionPaused" = "Mission execution переведён в паузу.";
"mission.event.detail.missionResumed" = "Mission execution продолжен после паузы.";
"mission.event.detail.missionBlocked" = "Выполнение миссии заблокировано текущим runtime/safety состоянием.";
"mission.event.detail.missionWarningRaised" = "Runtime safety layer опубликовал предупреждение миссии.";
"mission.event.detail.runtimeUnsafeDetected" = "Mission runtime признан небезопасным.";
"mission.event.detail.failsafeTriggered" = "Failsafe coordinator перевёл миссию в безопасную ветку.";
"mission.event.detail.returnHomeTriggered" = "Mission execution передан в return-home.";
"mission.event.detail.missionAborted" = "Mission execution был прерван.";
"mission.event.detail.missionCompleted" = "Mission execution завершил все активные точки.";
"mission.event.detail.debriefGenerated" = "По итоговому runtime состоянию сформирован mission debrief.";
"mission.event.detail.payloadActionTriggered" = "Запущено payload-действие миссии.";
"mission.event.detail.payloadActionCompleted" = "Payload-действие миссии завершено.";
"mission.event.detail.diagnosticsCritical" = "Критический diagnostics-инцидент привязан к mission timeline.";
"mission.timeline.title" = "ТАЙМЛАЙН МИССИИ";
"mission.timeline.empty" = "Таймлайн миссии пока отсутствует.";
"mission.timeline.empty.filtered" = "Событий, подходящих под текущий фильтр, нет.";
"mission.timeline.metric.events" = "СОБЫТИЯ";
"mission.timeline.metric.warnings" = "WARN";
"mission.timeline.metric.critical" = "CRIT";
"mission.timeline.filter.severity" = "SEVERITY";
"mission.timeline.filter.category" = "CATEGORY";
"mission.timeline.filter.severity.all" = "ВСЕ";
"mission.timeline.filter.severity.info" = "INFO";
"mission.timeline.filter.severity.warning" = "WARN";
"mission.timeline.filter.severity.critical" = "CRIT";
"mission.timeline.filter.category.all" = "ВСЕ";
"mission.debrief.title" = "DEBRIEF МИССИИ";
"mission.debrief.empty" = "Готовый debrief по завершённой миссии отсутствует.";
"mission.debrief.metric.duration" = "ДЛИТ.";
"mission.debrief.metric.route" = "МАРШРУТ";
"mission.debrief.metric.progress" = "ПРОГРЕСС";
"mission.debrief.metric.energy" = "БАТАРЕЯ";
"mission.debrief.metric.warnings" = "WARNINGS";
"mission.debrief.metric.critical" = "CRITICAL";
"mission.debrief.type.route" = "Маршрутная миссия";
"mission.debrief.type.delivery" = "Миссия доставки";
"mission.debrief.type.constrained" = "Миссия с ограничениями";
"mission.debrief.verdict.success" = "Миссия завершена по плану.";
"mission.debrief.verdict.partial_success" = "Миссия завершена частично или с деградацией.";
"mission.debrief.verdict.aborted" = "Миссия прервана оператором.";
"mission.debrief.verdict.failed" = "Миссия завершилась с отказом.";
"mission.debrief.verdict.returned_home" = "Миссия остановлена и переведена в возврат домой.";
"mission.debrief.verdict.safety_terminated" = "Миссия остановлена safety-логикой.";
"mission.outcome.success" = "УСПЕХ";
"mission.outcome.partial_success" = "ЧАСТИЧНО";
"mission.outcome.aborted" = "ПРЕРВАНО";
"mission.outcome.failed" = "СБОЙ";
"mission.outcome.returned_home" = "ВОЗВРАТ";
"mission.outcome.safety_terminated" = "SAFETY";
